_Rarzrabotki/Rarus/USO2/Documents/уатПланированиеРаботыТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>уатПланированиеРаботыТС</Name>
			<Comment>Планирование работы ТС</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.уатПланРаботыТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Comment>Сценарий</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПланирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставПлана</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДетализацияПланирования</Name>
							<Comment>Детализация планирования</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
								<v8:Type>cfg:CatalogRef.уатМоделиТС</v8:Type>
								<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрВыработки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Comment>Маршрут</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПеревозки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыПеревозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗаказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидБилета</Name>
							<Comment>Вид билета</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыБилетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатДетализацияПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатДетализацияПланирования</Name>
			<Comment>Детализация планирования</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МодельТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипТС</Name>
					<Comment>(уат)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/уатРазделыПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатРазделыПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыработкаТСпоПЛ</Name>
					<Comment>Выработка ТС по путевым листам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленныеУслуги</Name>
					<Comment>Предоставленные услуги</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/уатПланированиеРаботыТС/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	уатЗащищенныеФункцииСервер.уатДокументФормаЭлементаПриСозданииНаСервере(об, Отказ, СтандартнаяОбработка, ЭтотОбъект, ДопПараметрыОткрытие);
	ЗначениеВРеквизитФормы(Об,"Объект");
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	уатОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		,
		,
		,
		Параметры.ЗначенияЗаполнения
	);
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ВалютаРасчетов = Объект.Сценарий.Валюта;
	НациональнаяВалюта = мВалютаРегламентированногоУчета;
	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.Дата,
						Новый Структура("Валюта", НациональнаяВалюта));
	КурсНациональнаяВалюта = СтруктураПоВалюте.Курс;
	КратностьНациональнаяВалюта = СтруктураПоВалюте.Кратность;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.УчитыватьНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.УчитыватьНДС);
		Объект.СуммаВключаетНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
		ПланыВидовХарактеристик.уатПраваИНастройки.СуммаВключаетНДС);
		
		Если НЕ ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
			Объект.ДатаПланирования = НачалоМесяца(ДобавитьМесяц(ТекущаяДата(), 1));
		КонецЕсли;
	КонецЕсли;
	
	ПредУчитыватьНДС = Объект.УчитыватьНДС;
	ПредСуммаВключаетНДС = Объект.СуммаВключаетНДС;
	
	мТекущийСценарий = Объект.Сценарий;
	ОрганизацияПередИзменением = Объект.Организация;
	уатОбщегоНазначенияСервер.НастроитьПолеПодразделение(Элементы.Подразделение, "Объект.Организация");
	ОбновитьПараметрВыработкиВременныйСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатДокументФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	//РассчитатьСуммуДокумента();
	НДСВсего = Объект.СоставПлана.Итог("СуммаНДС");
	ВывестиСуммовыеИтогиДокумента();	
	ОбновитьВсегоВТЧ();
	ОбновитьНадписьПериодПланирования();
	ФорматироватьКолонкуДетализации();
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьВсегоВТЧСервер();
	ОбновитьПараметрВыработкиВременныйСервер();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьВсегоВТЧСервер();
	ОбновитьПараметрВыработкиВременныйСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
	КонтрольЗаполненияСтавкиНДС(Отказ);
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если флВопросЗакрытиеФормы Тогда
		Отказ = Истина;
		Оповещ = Новый ОписаниеОповещения("ПередЗакрытиемВопрос", ЭтотОбъект);
		ПоказатьВопрос(Оповещ, "При проверке корректности заполнения документа возникли предупреждения!
			|Продолжить закрытие формы?", РежимДиалогаВопрос.ОКОтмена);
	ИначеЕсли Модифицированность И НЕ Объект.Ссылка.Пустая() Тогда
		КонтрольЗаполненияСтавкиНДС(Отказ, Истина);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			//Объект.Номер = "";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеДатаПриИзменении(ДокументСсылка, ДатаНовая, ДатаПередИзменением)
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("РазностьДат", уатОбщегоНазначенияСервер.ПроверитьНомерДокумента(ДокументСсылка, ДатаНовая,
							ДатаПередИзменением));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДатаПриИзменении()

&НаКлиенте
Процедура ДатаПланированияПриИзменении(Элемент)
	уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования,
		уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "Периодичность"));
	ОбновитьНадписьПериодПланирования();
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзменении(Элемент)
	ДетПланирования = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "ДетализацияПланирования");
	мТекущийСценарий_ДетПланирования = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(мТекущийСценарий, "ДетализацияПланирования");
	
	Если ДетПланирования = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.Номенклатура") 
		ИЛИ ДетПланирования = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.НоменклатурнаяГруппа") Тогда
	 
		ТекстНСТР = НСтр("en='In the document ""Planning of vehicle work"" it is possible to use only scripts"
		"with detailed planning on the types of vehicles, models of vehicles and vehicles."
		"The initial script will be set';ru='В документе ""Планирование работы ТС"" возможно использовать только сценарии"
		"с детализацией планирования по типам ТС, моделям ТС и ТС. "
		"Будет установлен начальный сценарий'");
		ПоказатьПредупреждение(Новый ОписаниеОповещения("СценарийПриИзмененииПредупреждение", ЭтотОбъект,
			Новый Структура("ДетПланирования, мТекущийСценарий_ДетПланирования",
			ДетПланирования, мТекущийСценарий_ДетПланирования)),
			ТекстНСТР, 10);
			
		Возврат;
		
	ИначеЕсли ДетПланирования <> мТекущийСценарий_ДетПланирования Тогда
		
		Если Объект.СоставПлана.Количество() > 0 Тогда
			ТекстНСТР = НСтр("en='A script with planning detail ""%1"" is selected."
			"Detailed planning of the current script ""%2""."
			"Accept the change and clear the tabular section?';ru='Выбран сценарий с детализацией планирования ""%1""."
			"Детализация планирования текущего сценария ""%2""."
			"Принять изменение и очистить табличную часть?'");
			ТекстНСТР = СтрШаблон(ТекстНСТР, ДетПланирования, мТекущийСценарий_ДетПланирования);
			
			ПоказатьВопрос(Новый ОписаниеОповещения("СценарийПриИзмененииВопрос", ЭтотОбъект,
				Новый Структура("ДетПланирования, мТекущийСценарий_ДетПланирования",
				ДетПланирования, мТекущийСценарий_ДетПланирования)), 
				ТекстНСТР, РежимДиалогаВопрос.ОКОтмена, 0, КодВозвратаДиалога.Отмена);
				
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли;
	
	СценарийПриИзмененииПродолжение();
КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзмененииВопрос(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    КодВозврата = РезультатВопроса;
    
    Если КодВозврата = КодВозвратаДиалога.ОК Тогда
        Объект.СоставПлана.Очистить();
    Иначе
        Объект.Сценарий = мТекущийСценарий;
    КонецЕсли;
    
    СценарийПриИзмененииПродолжение();

КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзмененииПредупреждение(ДополнительныеПараметры) Экспорт
    
    ДетПланирования = ДополнительныеПараметры.ДетПланирования;
    мТекущийСценарий_ДетПланирования = ДополнительныеПараметры.мТекущийСценарий_ДетПланирования;
    
    Объект.Сценарий = мТекущийСценарий;
    
    СценарийПриИзмененииПродолжение();

КонецПроцедуры

&НаКлиенте
Процедура СценарийПриИзмененииПродолжение()
	//установка валюты из сценария
	Если уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "Раздел") =
		ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги") Тогда
			
		СтруктураДанные = ПолучитьДанныеСценарийПриИзменении(Объект.Дата, Объект.ВалютаДокумента, Объект.Сценарий);
		ВалютаРасчетовПередИзменением = ВалютаРасчетов;
		ВалютаРасчетов = СтруктураДанные.ВалютаРасчетов;
		Если ЗначениеЗаполнено(Объект.Сценарий) Тогда 
			Объект.КурсДокумента	   = ?(СтруктураДанные.ВалютаРасчетовКурсКратность.Курс = 0, 1,
											СтруктураДанные.ВалютаРасчетовКурсКратность.Курс);
			Объект.КратностьДокумента = ?(СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность = 0, 1,
											СтруктураДанные.ВалютаРасчетовКурсКратность.Кратность);
		КонецЕсли;
		Если (ЗначениеЗаполнено(Объект.Сценарий)
			И ЗначениеЗаполнено(ВалютаРасчетов)
			И Объект.Сценарий <> мТекущийСценарий
			И ВалютаРасчетовПередИзменением <> СтруктураДанные.ВалютаРасчетов)
			И Объект.ВалютаДокумента <> СтруктураДанные.ВалютаРасчетов Тогда
			
			Объект.ВалютаДокумента = СтруктураДанные.ВалютаРасчетов;
			ПоказатьПредупреждение(Неопределено, НСтр("en='Changed currency script!"
			"You need to check the currency of the document!';ru='Изменилась валюта по сценарию! "
			" Необходимо проверить валюту документа!'"));
		КонецЕсли;
	Иначе
		Объект.ВалютаДокумента = Неопределено;
		Объект.КурсДокумента = 0;
		Объект.КратностьДокумента = 0;
		Объект.УчитыватьНДС = Ложь;
		Объект.СуммаВключаетНДС = Ложь;
	КонецЕсли;
		
	уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоНачалуПериода(Объект.ДатаПланирования,
		уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "Периодичность"));
	ОбновитьНадписьПериодПланирования();
	
	// установки по типу планируемых показателей
	УстановитьВидимостьДоступность();
	
	ФорматироватьКолонкуДетализации();
	
	мТекущийСценарий = Объект.Сценарий;
КонецПроцедуры

// Получает набор данных с сервера для процедуры СценарийПриИзменении.
//
&НаСервереБезКонтекста
Функция ПолучитьДанныеСценарийПриИзменении(Дата, ВалютаДокумента, Сценарий)
	
	СтруктураДанные = Новый Структура;
	
	СтруктураДанные.Вставить(
	"ВалютаРасчетов",
	Сценарий.Валюта);
	
	СтруктураДанные.Вставить(
	"ВалютаРасчетовКурсКратность",
	РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Дата, Новый Структура("Валюта", Сценарий.Валюта)));
	
	Возврат СтруктураДанные;
	
КонецФункции // ПолучитьДанныеДоговорПриИзменении()

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Если Объект.Организация = ОрганизацияПередИзменением Тогда
		Возврат;
	КонецЕсли;
	ОрганизацияПередИзменением = Объект.Организация;
	
	УчитыватьНДСПередИзменением = Объект.УчитыватьНДС;
	СуммаВключаетНДСПередИзменением = Объект.СуммаВключаетНДС;
	
	Объект.УчитыватьНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.УчитыватьНДС"));
	Объект.СуммаВключаетНДС = уатПраваИНастройки.уатПолучитьПраваИНастройкиПользователя(Объект.Организация,
		ПредопределенноеЗначение("ПланВидовХарактеристик.уатПраваИНастройки.СуммаВключаетНДС"));

	Если Объект.УчитыватьНДС <> УчитыватьНДСПередИзменением ИЛИ Объект.СуммаВключаетНДС <> СуммаВключаетНДСПередИзменением Тогда
		ПересчитатьСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС("СоставПлана");
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		ОбновитьВсегоВТЧ();
		РассчитатьСуммуДокумента();
		УстановитьВидимостьДоступность();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура УчитыватьНДСПриИзменении(Элемент)
	Если НЕ Объект.УчитыватьНДС Тогда
		Объект.СуммаВключаетНДС = Ложь;
	КонецЕсли;
	
	ПриИзмененииПараметровНДСиКурса();
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
	ПриИзмененииПараметровНДСиКурса();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПараметровНДСиКурса()
	Если Объект.УчитыватьНДС <> ПредУчитыватьНДС Тогда
		ЗаполнитьСтавкуНДСПоНалогообложениеНДС();
		УстановитьВидимостьДоступность();
	КонецЕсли;
	
	Если Объект.УчитыватьНДС <> ПредУчитыватьНДС ИЛИ Объект.СуммаВключаетНДС <> ПредСуммаВключаетНДС Тогда
		Для Каждого ТекСтрока Из Объект.СоставПлана Цикл
			РассчитатьСуммуНДС(ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьВсегоВТЧ();
	РассчитатьСуммуДокумента();
		
	ПредУчитыватьНДС = Объект.УчитыватьНДС;
	ПредСуммаВключаетНДС = Объект.СуммаВключаетНДС;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормы_СоставПлана

&НаКлиенте
Процедура СоставПланаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ ЗначениеЗаполнено(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "ДетализацияПланирования")) Тогда
		Отказ = Истина;
		ТекстНСТР = НСтр("en='Details of planning in script are not indicated or the script is not filled!';ru='Не указана детализация планирования у сценария или не заполнен сценарий!'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР, 10);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекСтрока = Элементы.СоставПлана.ТекущиеДанные;
		
	Если ТекСтрока.ПараметрВыработкиВременный Тогда
		Элементы.СоставПланаКоличество.ФорматРедактирования = "ЧДЦ=2; ЧРД=:";
	Иначе
		Элементы.СоставПланаКоличество.ФорматРедактирования = "";
	КонецЕсли;
	
	Если НоваяСтрока И НЕ Копирование Тогда
		Если Объект.УчитыватьНДС И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "Раздел")
			= ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги") Тогда
			ТекСтрока.СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	РассчитатьСуммуДокумента();
	ОбновитьВсегоВТЧ();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПослеУдаления(Элемент)
	РассчитатьСуммуДокумента();
	ОбновитьВсегоВТЧ();
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаПараметрВыработкиПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставПлана.ТекущиеДанные;
	
	ОбновитьПараметрВыработкиВременныйСервер();
	
	Если СтрокаТабличнойЧасти.ПараметрВыработкиВременный Тогда
		Элементы.СоставПланаКоличество.ФорматРедактирования = "ЧДЦ=2; ЧРД=:";
	Иначе
		Элементы.СоставПланаКоличество.ФорматРедактирования = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.СоставПлана.ТекущиеДанные;
	Если ТекСтрока.ПараметрВыработкиВременный Тогда
		уатЗащищенныеФункцииСервер.КонтрольВводаВремени(ТекСтрока.Количество);
	КонецЕсли;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаЦенаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставПлана.ТекущиеДанные;
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаСуммаПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставПлана.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти.Количество <> 0 Тогда
		СтрокаТабличнойЧасти.Цена = СтрокаТабличнойЧасти.Сумма / СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаСтавкаНДСПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.СоставПлана.ТекущиеДанные;
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура СоставПланаНоменклатураПриИзменении(Элемент)
	Если Объект.УчитыватьНДС И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "Раздел")
		= ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги") Тогда
		СтрокаТабличнойЧасти = Элементы.СоставПлана.ТекущиеДанные;
		СтрокаТабличнойЧасти.СтавкаНДС = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(СтрокаТабличнойЧасти.Номенклатура, "СтавкаНДС");
		РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура РедактироватьЦеныИВалюту(Команда)
	ОбработатьИзмененияПоКнопкеЦеныИВалюты(Объект.ВалютаДокумента);
	ОбновитьВсегоВТЧ();
	РассчитатьСуммуДокумента();
	Модифицированность = Истина;
КонецПроцедуры

// Процедура выполняет пересчет в табличной части документа после изменений 
// в форме "Цены и валюта".Выполняется пересчет колонок: цена, скидка, сумма,
// сумма НДС, всего.
//
&НаКлиенте
Процедура ОбработатьИзмененияПоКнопкеЦеныИВалюты(Знач ВалютаРасчетовПередИзменением, ПересчитатьЦены = Ложь)
	
	// 1. Формируем структуру параметров для заполнения формы "Цены и Валюта".
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВалютаДокумента",		  Объект.ВалютаДокумента);
	СтруктураПараметров.Вставить("КурсДокумента",		  Объект.КурсДокумента);
	СтруктураПараметров.Вставить("КратностьДокумента",	  Объект.КратностьДокумента);
	//СтруктураПараметров.Вставить("Контрагент",			  Объект.Контрагент);
	//СтруктураПараметров.Вставить("Договор",				  Объект.ДоговорКонтрагента);
	СтруктураПараметров.Вставить("Организация",			  Объект.Организация);
	СтруктураПараметров.Вставить("ДатаДокумента",		  Объект.Дата);
	СтруктураПараметров.Вставить("ПерезаполнитьЦены",	  Ложь);
	СтруктураПараметров.Вставить("ПересчитатьЦены",		  ПересчитатьЦены);
	СтруктураПараметров.Вставить("БылиВнесеныИзменения",  Ложь);
	СтруктураПараметров.Вставить("СуммаВключаетНДС",      Объект.СуммаВключаетНДС);
	СтруктураПараметров.Вставить("НалогообложениеНДС",	  Объект.УчитыватьНДС);
	// Для объедининенного решения с БП 3
	СтруктураПараметров.Вставить("ДокументБезНДС",       НЕ Объект.УчитыватьНДС);
	// Для объедининенного решения с БП 3

	Если НЕ ПравоРедактированиеДокумента() Тогда
		СтруктураПараметров.Вставить("ТолькоПросмотр", Истина);
	КонецЕсли;
	
	// 2. Открываем форму "Цены и Валюта".
	ДополнительныеПараметры = Новый Структура("ВалютаРасчетовПередИзменением, ПересчитатьЦены", ВалютаРасчетовПередИзменением, ПересчитатьЦены);
	СтруктураЦеныИВалюта = ОткрытьФорму("ОбщаяФорма.ФормаЦеныИВалюта", СтруктураПараметров,,,,,
		Новый ОписаниеОповещения("ОбработкаЗакрытияФормыЦеныИВалюта", ЭтотОбъект, ДополнительныеПараметры));
	
КонецПроцедуры // ОбработатьИзмененияПоКнопкеЦеныИВалюты()

&НаКлиенте
Процедура ОбработкаЗакрытияФормыЦеныИВалюта(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Отмена ИЛИ НЕ ПравоРедактированиеДокумента() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураЦеныИВалюта = Результат;
	
	// 3. Перезаполняем табличную часть "Номенклатура", если были внесены изменения в форме "Цены и Валюта".
	Если ТипЗнч(СтруктураЦеныИВалюта) = Тип("Структура") Тогда
		
		// Для объедининенного решения с БП 3
		уатОбщегоНазначенияКлиент.ЗаполнитьСтруктуруЦеныИВалютыДляБП3(СтруктураЦеныИВалюта, Объект.ВалютаДокумента,
			ДополнительныеПараметры.ВалютаРасчетовПередИзменением, Объект.УчитыватьНДС, Объект.СуммаВключаетНДС);
		// Для объедининенного решения с БП 3
		
		Если СтруктураЦеныИВалюта.Свойство("ВалютаДокумента") И СтруктураЦеныИВалюта.Свойство("Курс") И СтруктураЦеныИВалюта.Свойство("Кратность") И
			СтруктураЦеныИВалюта.Свойство("СуммаВключаетНДС") И  СтруктураЦеныИВалюта.Свойство("НалогообложениеНДС") Тогда
			Объект.ВалютаДокумента		   = СтруктураЦеныИВалюта.ВалютаДокумента;
			Объект.КурсДокумента	   = СтруктураЦеныИВалюта.Курс;
			Объект.КратностьДокумента = СтруктураЦеныИВалюта.Кратность;
			Объект.СуммаВключаетНДС		   = СтруктураЦеныИВалюта.СуммаВключаетНДС;
			Объект.УчитыватьНДС			   = СтруктураЦеныИВалюта.НалогообложениеНДС;
		КонецЕсли;
		// Пересчитываем сумму если изменился признак Налогообложение НДС.
		Если СтруктураЦеныИВалюта.Свойство("НалогообложениеНДС") И СтруктураЦеныИВалюта.Свойство("ПредНалогообложениеНДС") Тогда
			Если СтруктураЦеныИВалюта.НалогообложениеНДС <> СтруктураЦеныИВалюта.ПредНалогообложениеНДС Тогда
				ЗаполнитьСтавкуНДСПоНалогообложениеНДС();		
			КонецЕсли;
		КонецЕсли;
		
		// Пересчитываем цены по валюте.
		Если СтруктураЦеныИВалюта.Свойство("ПересчитатьЦены") Тогда
			Если  СтруктураЦеныИВалюта.ПересчитатьЦены Тогда	
				ПересчитатьЦеныТабличнойЧастиПоВалюте(ДополнительныеПараметры.ВалютаРасчетовПередИзменением, "СоставПлана");
			КонецЕсли;
		КонецЕсли;
		
		// Пересчитываем сумму если изменился признак "Сумма включает НДС".
		Если СтруктураЦеныИВалюта.Свойство("СуммаВключаетНДС") И СтруктураЦеныИВалюта.Свойство("ПредСуммаВключаетНДС") Тогда
			Если СтруктураЦеныИВалюта.СуммаВключаетНДС <> СтруктураЦеныИВалюта.ПредСуммаВключаетНДС Тогда
				ПересчитатьСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС("СоставПлана");
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьВсегоВТЧ();
	РассчитатьСуммуДокумента();
	ВывестиСуммовыеИтогиДокумента();
	
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлан(Команда)
	Если НЕ ЗначениеЗаполнено(уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "ДетализацияПланирования")) Тогда
		ТекстНСТР = НСтр("en='Details of planning in script are not indicated or the script is not filled!';ru='Не указана детализация планирования у сценария или не заполнен сценарий!'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР);
		Возврат;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаПланирования) Тогда
		ПоказатьПредупреждение(Неопределено, "Не указан период планирования!");
		Возврат;
	КонецЕсли;
	
	Если Объект.СоставПлана.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Clear the tabular section before filling?';ru='Очистить табличную часть перед заполнением?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПланЗавершение1", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена);
        Возврат;
	КонецЕсли;
	
	ЗаполнитьПланФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПланЗавершение1(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Отмена Тогда
        Возврат;
    ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
        Объект.СоставПлана.Очистить();
    КонецЕсли;
    
    ЗаполнитьПланФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПланФрагмент()
    
    Перем ПараметрыФормы, Рез;
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("Сценарий", Объект.Сценарий);
    ПараметрыФормы.Вставить("Организация", Объект.Организация);
    ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
    ПараметрыФормы.Вставить("ДатаНач", Объект.ДатаПланирования);
    ПараметрыФормы.Вставить("ДатаКон", Объект.ДатаПланирования);
    ПараметрыФормы.Вставить("УчитыватьНДС", Объект.УчитыватьНДС);
    ПараметрыФормы.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
    уатОбщегоНазначенияТиповые.уатВыровнятьДатуПоКонцуПериода(ПараметрыФормы.ДатаКон,
    	уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "Периодичность"));
    
    Рез = Неопределено;
    
    
    ОткрытьФорму("Обработка.уатПомощникПланированияРаботыТС.Форма", ПараметрыФормы, ЭтотОбъект,,,, Новый ОписаниеОповещения("ЗаполнитьПланЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПланЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
    Рез = Результат;
    Если ТипЗнч(Рез) = Тип("Массив") Тогда
		флПланированиеУслуг = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "Раздел") = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги");
		Для Каждого ТекСтрока Из Рез Цикл
            НоваяСтрока = Объект.СоставПлана.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
			Если Объект.УчитыватьНДС И флПланированиеУслуг И НЕ ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
				НоваяСтрока.СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ПользователиКлиентСервер.АвторизованныйПользователь(), "ОсновнаяСтавкаНДС");
				РассчитатьСуммуНДС(НоваяСтрока);
			КонецЕсли;
		КонецЦикла;
        
        ОбновитьВсегоВТЧСервер();
        ОбновитьПараметрВыработкиВременныйСервер();
        Элементы.СоставПлана.Обновить();
		РассчитатьСуммуДокумента();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПланЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        Объект.СоставПлана.Очистить();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПлан(Команда)
	Если Объект.СоставПлана.Количество() > 0 Тогда
		ТекстНСТР = НСтр("en='Plan will be cleared. Continue?';ru='Будет выполнена очистка состава плана. Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьПланЗавершение", ЭтотОбъект),
			ТекстНСТР, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	КонецЕСли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоТарифам(Команда)
	Если Объект.СоставПлана.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("РассчитатьПоТарифамЗавершение", ЭтотОбъект),
		"Цена и сумма услуг будет перезаполнена по тарифам ТС во всех строках. Продолжить?", РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьПоТарифамЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьПоТарифамСервер();
	Для Каждого ТекСтрока Из Объект.СоставПлана Цикл
		//РассчитатьСуммуНДС(ТекСтрока);
		РассчитатьСуммуВСтрокеТабличнойЧасти(ТекСтрока);
	КонецЦикла;
	РассчитатьСуммуДокумента();
	ОбновитьВсегоВТЧ();
КонецПроцедуры

&НаСервере
Процедура РассчитатьПоТарифамСервер() Экспорт
	КешУскорения = Неопределено;
	Для Каждого ТекСтрока Из Объект.СоставПлана Цикл
		РассчитатьУслугуПоТарифамВСтроке(ТекСтрока, КешУскорения);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РассчитатьУслугуПоТарифамВСтроке(ТекСтрока, КешУскорения) Экспорт 
	СписокФильтров = Новый Структура();
	СписокФильтров.Вставить("Дата", Объект.ДатаПланирования);
	СписокФильтров.Вставить("Организация", Объект.Организация);
	СписокФильтров.Вставить("Контрагент", ТекСтрока.Контрагент);
	СписокФильтров.Вставить("ДоговорКонтрагента", ТекСтрока.Договор);
	СписокФильтров.Вставить("Маршрут", ТекСтрока.Маршрут);
	СписокФильтров.Вставить("ОбъектСтроительства", ТекСтрока.ОбъектСтроительства);
	СписокФильтров.Вставить("ВидПеревозки", ТекСтрока.ВидПеревозки);
	
	ДопФильтры = Новый Структура();
	ДопФильтры.Вставить("Услуга", ТекСтрока.Номенклатура);
	ДопФильтры.Вставить("ПрейскурантПоставщика", Ложь);
	ДопФильтры.Вставить("Контрагент", ТекСтрока.Контрагент);
	ДопФильтры.Вставить("ПараметрВыработки", ТекСтрока.ПараметрВыработки);
	
	//параметры сложных тарифов
	мГрузоподъемность = 0;
	мОбъемКузова = 0;
	мКлассГруза = 0;
	Если ТипЗнч(ТекСтрока.ДетализацияПланирования) = Тип("СправочникСсылка.ТранспортныеСредства") Тогда
		СписокФильтров.Вставить("Тягач", ТекСтрока.ДетализацияПланирования);
		СписокФильтров.Вставить("МодельТягача", ТекСтрока.ДетализацияПланирования.уатМодель);
		СписокФильтров.Вставить("ТипТягача", ТекСтрока.ДетализацияПланирования.Тип);
		мГрузоподъемность = ТекСтрока.ДетализацияПланирования.уатМодель.Грузоподъемность;
		мОбъемКузова = ТекСтрока.ДетализацияПланирования.уатМодель.ОбъемКузова;
	ИначеЕсли ТипЗнч(ТекСтрока.ДетализацияПланирования) = Тип("СправочникСсылка.уатМоделиТС") Тогда
		СписокФильтров.Вставить("МодельТягача", ТекСтрока.ДетализацияПланирования);
		СписокФильтров.Вставить("ТипТягача", ТекСтрока.ДетализацияПланирования.ТипТС);
		мГрузоподъемность = ТекСтрока.ДетализацияПланирования.Грузоподъемность;
		мОбъемКузова = ТекСтрока.ДетализацияПланирования.ОбъемКузова;
	ИначеЕсли ТипЗнч(ТекСтрока.ДетализацияПланирования) = Тип("СправочникСсылка.ТипыТранспортныхСредств") Тогда
		СписокФильтров.Вставить("ТипТягача", ТекСтрока.ДетализацияПланирования);
	КонецЕсли;
	мРасстояниеГруз = 0;
	мВремяРаботы = 0;
	мКоличествоТонн = 0;
	мОбъем = 0;
	Если ТекСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.ПробегСГрузом Тогда
		мРасстояниеГруз = ТекСтрока.Количество;
	ИначеЕсли ТекСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВремяВРаботе Тогда
		мВремяРаботы = уатОбщегоНазначения.уатВремяВСекунды(ТекСтрока.Количество);
	ИначеЕсли ТекСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.ВесГруза Тогда
		мКоличествоТонн = ТекСтрока.Количество;
	ИначеЕсли ТекСтрока.ПараметрВыработки = Справочники.уатПараметрыВыработки.Объем Тогда
		мОбъем = ТекСтрока.Количество;
	КонецЕсли;
	
	//промежуточная таблица стоимости услуг для выбора оптимального тарифа
	тблСтоимость = Новый ТаблицаЗначений;
	тблСтоимость.Колонки.Добавить("ПараметрВыработки");
	тблСтоимость.Колонки.Добавить("Контрагент");
	тблСтоимость.Колонки.Добавить("Договор");
	тблСтоимость.Колонки.Добавить("Маршрут");
	тблСтоимость.Колонки.Добавить("ОбъектСтроительства");
	тблСтоимость.Колонки.Добавить("ВидПеревозки");
	тблСтоимость.Колонки.Добавить("НоменклатураУслуги");
	тблСтоимость.Колонки.Добавить("Количество");
	тблСтоимость.Колонки.Добавить("Цена");
	тблСтоимость.Колонки.Добавить("Сумма");
	тблСтоимость.Колонки.Добавить("СтавкаНДС");
	тблСтоимость.Колонки.Добавить("СуммаНДС");
	тблСтоимость.Колонки.Добавить("Прейскурант");
	тблСтоимость.Колонки.Добавить("Тариф");
	тблСтоимость.Колонки.Добавить("СтепеньСовпаденияФильтров");
		
	//ищем прейскурант
	мТаблицаПрейскурант = уатОбщегоНазначения.уатНайтиПрейскурант(СписокФильтров, Объект.Организация, Объект.ДатаПланирования, ДопФильтры, КешУскорения);
		
	//не нашли прейскурант
	Если мТаблицаПрейскурант.Количество() = 0 Тогда
		ТекСтрока.Цена = 0;
		Возврат;
	КонецЕсли;	
		
	//нашли прейскурант с тарифами - перебираем, добавляем строки стоимости
	Для Каждого ТекСтрокаТариф из мТаблицаПрейскурант Цикл
		мСсылкаТариф = ТекСтрокаТариф.Тариф;
		мПрейскурант = ТекСтрокаТариф.Прейскурант;
		
		//процентные тарифы игнорируем
		Если мСсылкаТариф.МетодРасчета <> Перечисления.уатМетодыРасчетаПоТарифам.ФиксированнойСуммой
			И мСсылкаТариф.МетодРасчета <> Перечисления.уатМетодыРасчетаПоТарифам.ПоПараметруВыработки Тогда
			Продолжить;
		КонецЕсли;
			
		мТариф = уатОбщегоНазначения.уатНайтиТариф(мСсылкаТариф, мРасстояниеГруз, мВремяРаботы/3600, 
			мГрузоподъемность, мКлассГруза, мКоличествоТонн, мОбъем,,, мОбъемКузова, ТекСтрокаТариф.ID);
			
		Рез = ДобавитьСтрокуСтоимости(ТекСтрока, ТекСтрока.ПараметрВыработки, ТекСтрока.Количество, 
			мПрейскурант, мСсылкаТариф, мТариф,, ТекСтрокаТариф.ID, тблСтоимость, ТекСтрокаТариф.СтепеньСовпаденияФильтров);
	КонецЦикла;
	
	// для фикс. тарифов с условием применения "Всегда" оставляем только максимальный по степени совпадения фильтров
	МаксСтепеньСовпадения = 0;
	Для Каждого ТекСтрокаСтоимость Из тблСтоимость Цикл
		Если ТекСтрокаСтоимость.Тариф.МетодРасчета = Перечисления.уатМетодыРасчетаПоТарифам.ФиксированнойСуммой
			И ТекСтрокаСтоимость.Тариф.УсловиеПримененияФиксТарифа = 1
			И ТипЗнч(ТекСтрокаСтоимость.СтепеньСовпаденияФильтров) = Тип("Число") Тогда
			
			МаксСтепеньСовпадения = Макс(МаксСтепеньСовпадения, ТекСтрокаСтоимость.СтепеньСовпаденияФильтров);
		КонецЕсли;
	КонецЦикла;
	Сч = тблСтоимость.Количество() - 1;
	Пока Сч >= 0 Цикл
		ТекСтрокаСтоимость = тблСтоимость[Сч];
		Если ТекСтрокаСтоимость.Тариф.МетодРасчета = Перечисления.уатМетодыРасчетаПоТарифам.ФиксированнойСуммой
			И ТекСтрокаСтоимость.Тариф.УсловиеПримененияФиксТарифа = 1
			И ТипЗнч(ТекСтрокаСтоимость.СтепеньСовпаденияФильтров) = Тип("Число")
			И ТекСтрокаСтоимость.СтепеньСовпаденияФильтров < МаксСтепеньСовпадения Тогда
			тблСтоимость.Удалить(ТекСтрокаСтоимость);
		КонецЕсли;
		Сч = Сч - 1;
	КонецЦикла;
			
	// удаляем лишние тарифы согласно настройке приоритета тарифов по стоимости в прейскуранте
	Сч = тблСтоимость.Количество() - 1;
	Пока Сч >= 0 Цикл
		ТекСтрокаСтоимость = тблСтоимость[Сч];
		
		Для Каждого ТекСтрокаПоиска Из тблСтоимость Цикл
			Если ТекСтрокаПоиска <> ТекСтрокаСтоимость
				И ТекСтрокаПоиска.Прейскурант = ТекСтрокаСтоимость.Прейскурант
				И ТекСтрокаПоиска.ПараметрВыработки = ТекСтрокаСтоимость.ПараметрВыработки
				И (ТекСтрокаСтоимость.Прейскурант.ПриоритетТарифов = 0 И ТекСтрокаСтоимость.Сумма <= ТекСтрокаПоиска.Сумма
				ИЛИ ТекСтрокаСтоимость.Прейскурант.ПриоритетТарифов = 1 И ТекСтрокаСтоимость.Сумма >= ТекСтрокаПоиска.Сумма) Тогда
				
				тблСтоимость.Удалить(ТекСтрокаСтоимость);
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Сч = Сч - 1;
	КонецЦикла;
		
	Если тблСтоимость.Количество() > 0 Тогда
		ТекСтрока.Номенклатура = тблСтоимость[0].НоменклатураУслуги;
		ТекСтрока.Цена = тблСтоимость[0].Цена;
		ТекСтрока.Количество = тблСтоимость[0].Количество;
		ТекСтрока.Сумма = тблСтоимость[0].Сумма;
		Если Объект.УчитыватьНДС И уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "Раздел")
			= ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги") Тогда
			ТекСтрока.СтавкаНДС = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекСтрока.Номенклатура, "СтавкаНДС");
			ТекСтрока.СуммаНДС = тблСтоимость[0].СуммаНДС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //РассчитатьСтоимостьУслуг

&НаСервере
Функция ДобавитьСтрокуСтоимости(ТекСтрока, ПараметрВыработки, Количество, СсылкаПрейскурант, СсылкаТариф, Тариф, БазовыйТариф = 0, IDСтроки = Неопределено, тблСтоимость, СтепеньСовпаденияФильтров = Неопределено)
	ЭтоСтандарт = уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД();
	
	ФиксТариф = (СсылкаТариф.МетодРасчета = Перечисления.уатМетодыРасчетаПоТарифам.ФиксированнойСуммой);
	ВырабТариф = (СсылкаТариф.МетодРасчета = Перечисления.уатМетодыРасчетаПоТарифам.ПоПараметруВыработки);
	КоличествоВыраб = уатОбщегоНазначения.уатВремяВСекунды(Количество)/3600;
			
	Если Тариф > 0 И (ФиксТариф ИЛИ Количество > 0) Тогда
		СуммаВключаетНДС = СсылкаПрейскурант.СуммаВключаетНДС;
		НоваяСтрока = тблСтоимость.Добавить();
		НоваяСтрока.СтепеньСовпаденияФильтров = СтепеньСовпаденияФильтров;
		НоваяСтрока.Прейскурант = СсылкаПрейскурант;
		НоваяСтрока.Тариф = СсылкаТариф;
		НоваяСтрока.НоменклатураУслуги = СсылкаТариф.НоменклатураУслуги;
		
		КурсКратностьВалютыДокумента = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.ДатаПланирования);
		КурсКратностьВалютыПрейскуранта = уатОбщегоНазначенияТиповые.ПолучитьКурсВалюты(СсылкаПрейскурант.Валюта, Объект.ДатаПланирования);
			
		Если ФиксТариф Тогда
			КоличествоЗначение = 1;
			ЦенаЗначение = Тариф;
			СуммаЗначение = Тариф;
			
			//не используем тариф, если минимальная выработка больше выработки по документу
			Если СсылкаТариф.ТарифнаяСетка Тогда
				СтрокаТарифа = СсылкаТариф.СтрокиТарифнойСетки.Найти(IDстроки, "ID");
				Если СтрокаТарифа = Неопределено Тогда
					МинВыраб = 0;
				Иначе
					МинВыраб = СтрокаТарифа.МинимальнаяВыработка;
				КонецЕсли;
			Иначе
				МинВыраб = СсылкаТариф.МинимальнаяВыработка;
			КонецЕсли;
			Если КоличествоВыраб < МинВыраб И СсылкаТариф.УсловиеПримененияФиксТарифа = 0 Тогда
				тблСтоимость.Удалить(НоваяСтрока);
				Возврат Ложь;
			КонецЕсли;
			
		ИначеЕсли ВырабТариф Тогда
			КоличествоЗначение = КоличествоВыраб;
			ЦенаЗначение = Тариф;
			СуммаЗначение = КоличествоЗначение * Тариф;
			
			Если СсылкаТариф.ТарифнаяСетка Тогда
				СтрокаТарифа = СсылкаТариф.СтрокиТарифнойСетки.Найти(IDстроки, "ID");
				Если СтрокаТарифа = Неопределено Тогда
					МинСтоим = 0;
					МинВыраб = 0;
					СпособЗаполн = 0;
				Иначе
					МинСтоим = СтрокаТарифа.МинимальнаяСтоимость;
					МинВыраб = СтрокаТарифа.МинимальнаяВыработка;
					СпособЗаполн = СтрокаТарифа.СпособЗаполненияКоличества;
				КонецЕсли;
			Иначе
				МинСтоим = СсылкаТариф.МинимальнаяСтоимость;
				МинВыраб = СсылкаТариф.МинимальнаяВыработка;
				СпособЗаполн = СсылкаТариф.СпособЗаполненияКоличества;
			КонецЕсли;
				
			Если СуммаЗначение < МинСтоим Тогда
				СуммаЗначение = МинСтоим;
				Если СпособЗаполн = 0 Тогда
					ЦенаЗначение = СуммаЗначение / КоличествоЗначение;
				ИначеЕсли СпособЗаполн = 1 Тогда
					КоличествоЗначение = ?(Тариф = 0, 0, СуммаЗначение / Тариф);
				Иначе
					КоличествоЗначение = 1;
					ЦенаЗначение = СуммаЗначение;
				КонецЕсли;
			ИначеЕсли КоличествоЗначение < МинВыраб Тогда
				СуммаЗначение = МинВыраб * Тариф;
				Если СпособЗаполн = 0 Тогда
					ЦенаЗначение = СуммаЗначение / КоличествоЗначение;
				ИначеЕсли СпособЗаполн = 1 Тогда
					КоличествоЗначение = МинВыраб;
				Иначе
					КоличествоЗначение = 1;
					ЦенаЗначение = СуммаЗначение;
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			КоличествоЗначение = 1;
			ЦенаЗначение = БазовыйТариф * Тариф / 100;
			СуммаЗначение = ЦенаЗначение;
			
		КонецЕсли;
		
		ТекСтавкаНДС = НоваяСтрока.НоменклатураУслуги.СтавкаНДС;
		СуммаНДСЗначение = 0;
		Если Объект.УчитыватьНДС И ЗначениеЗаполнено(ТекСтавкаНДС) Тогда
			НоваяСтрока.СтавкаНДС = ТекСтавкаНДС;
			СуммаНДСЗначение = уатОбщегоНазначенияТиповые.уатРассчитатьСуммуНДС(СуммаЗначение,
				Объект.УчитыватьНДС, СсылкаПрейскурант.СуммаВключаетНДС,
				уатОбщегоНазначенияТиповые.уатПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС));
			Если НЕ Объект.СуммаВключаетНДС И СсылкаПрейскурант.СуммаВключаетНДС Тогда
				СуммаЗначение = СуммаЗначение - СуммаНДСЗначение;
				ЦенаЗначение = ?(КоличествоЗначение = 0, 0, СуммаЗначение / КоличествоЗначение);
			ИначеЕсли Объект.СуммаВключаетНДС И НЕ СсылкаПрейскурант.СуммаВключаетНДС Тогда
				СуммаЗначение = СуммаЗначение + СуммаНДСЗначение;
				ЦенаЗначение = ?(КоличествоЗначение = 0, 0, СуммаЗначение / КоличествоЗначение);
			КонецЕсли;
		КонецЕсли;
		
		//пересчитываем по валюте документа
		Если ФиксТариф ИЛИ ВырабТариф Тогда 
			ЦенаЗначение = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(ЦенаЗначение, 
				СсылкаПрейскурант.Валюта, Объект.ВалютаДокумента,
				КурсКратностьВалютыПрейскуранта.Курс, КурсКратностьВалютыДокумента.Курс,
				КурсКратностьВалютыПрейскуранта.Кратность, КурсКратностьВалютыДокумента.Кратность);
			СуммаЗначение = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаЗначение, 
				СсылкаПрейскурант.Валюта, Объект.ВалютаДокумента,
				КурсКратностьВалютыПрейскуранта.Курс, КурсКратностьВалютыДокумента.Курс,
				КурсКратностьВалютыПрейскуранта.Кратность, КурсКратностьВалютыДокумента.Кратность);
			СуммаНДСЗначение = уатОбщегоНазначенияТиповые.ПересчитатьИзВалютыВВалюту(СуммаНДСЗначение, 
				СсылкаПрейскурант.Валюта, Объект.ВалютаДокумента,
				КурсКратностьВалютыПрейскуранта.Курс, КурсКратностьВалютыДокумента.Курс,
				КурсКратностьВалютыПрейскуранта.Кратность, КурсКратностьВалютыДокумента.Кратность);
		КонецЕсли;
		
		НоваяСтрока.Количество = КоличествоЗначение;
		НоваяСтрока.Цена = ЦенаЗначение;
		НоваяСтрока.Сумма = СуммаЗначение;
		НоваяСтрока.СуммаНДС = СуммаНДСЗначение;
		
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	флПланированиеУслуг = (уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "Раздел") = ПредопределенноеЗначение("Перечисление.уатРазделыПланирования.ПредоставленныеУслуги"));
	
	Элементы.СоставПланаДоговор.Видимость = флПланированиеУслуг;
	Элементы.СоставПланаДоговор.Видимость = флПланированиеУслуг;
	Элементы.СоставПланаЦена.Видимость = флПланированиеУслуг;
	Элементы.СоставПланаСумма.Видимость = флПланированиеУслуг;
	Элементы.СоставПланаСтавкаНДС.Видимость = флПланированиеУслуг И Объект.УчитыватьНДС;
	Элементы.СоставПланаСуммаНДС.Видимость = флПланированиеУслуг И Объект.УчитыватьНДС;
	Элементы.СоставПланаВсего.Видимость = флПланированиеУслуг И Объект.УчитыватьНДС;
	Элементы.СоставПланаГруппаРассчитать.Видимость = флПланированиеУслуг;
	Элементы.СтраницыИтогов.Видимость = флПланированиеУслуг;
	
	Если флПланированиеУслуг Тогда
		Элементы.ГруппаСоставПлана.Заголовок = "Услуги";
		Если уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "ПланированиеПоГруппамУслуг") = Истина Тогда
			Элементы.СоставПланаНоменклатура.ВыборГруппИЭлементов = ГруппыИЭлементы.Группы;
		Иначе
			Элементы.СоставПланаНоменклатура.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
		КонецЕсли;
	Иначе
		Элементы.ГруппаСоставПлана.Заголовок = "Выработка";
		Элементы.СоставПланаНоменклатура.ВыборГруппИЭлементов = ГруппыИЭлементы.Элементы;
	КонецЕсли;
	
	ВывестиСуммовыеИтогиДокумента();
КонецПроцедуры

// Процедура для обновления надписи периода планирования в соответствии с периодичностью плана
//
&НаСервере
Процедура ОбновитьНадписьПериодПланирования()
	Если Объект.ДатаПланирования = '00010101' Тогда
		НадписьПериод = "<не указан>";
		Возврат;
	КонецЕсли;
	
	НачДата = Объект.ДатаПланирования;
	КонДата = Объект.ДатаПланирования;
	уатОбщегоНазначенияТиповые.уатВыровнятьПериод(НачДата, КонДата, Объект.Сценарий.Периодичность);
	НадписьПериод = Формат(НачДата, "ДФ = дд.ММ.гггг") + " - " + Формат(КонДата, "ДФ = дд.ММ.гггг");
КонецПроцедуры

// Устанавливает текст шапки в колонке "Детализация" ТС, Тип ТС или Модель ТС
&НаКлиенте
Процедура ФорматироватьКолонкуДетализации()
	ДетПланир = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Объект.Сценарий, "ДетализацияПланирования");
	Если ДетПланир = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.МодельТС") Тогда
		Элементы.СоставПланаДетализацияПланирования.Заголовок = НСтр("en='Vehicle model';ru='Модель ТС'");
		Элементы.СоставПланаДетализацияПланирования.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.уатМоделиТС");
	ИначеЕсли ДетПланир = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.ТипТС") Тогда
		Элементы.СоставПланаДетализацияПланирования.Заголовок = НСтр("en='Vehicle type';ru='Тип ТС'");
		Элементы.СоставПланаДетализацияПланирования.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТипыТранспортныхСредств");
	ИначеЕсли ДетПланир = ПредопределенноеЗначение("Перечисление.уатДетализацияПланирования.ТС") Тогда
		Элементы.СоставПланаДетализацияПланирования.Заголовок = НСтр("en='Vehicle';ru='ТС'");
		Элементы.СоставПланаДетализацияПланирования.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ТранспортныеСредства");
	Иначе
		Элементы.СоставПланаДетализацияПланирования.Заголовок = НСтр("en='Detail';ru='Детализация'");
		Элементы.СоставПланаДетализацияПланирования.ОграничениеТипа = Новый ОписаниеТипов("Неопределено");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВсегоВстрокеТЧ(СтрокаТабличнойЧасти)
	СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВсегоВТЧ()
	Для Каждого СтрокаТабличнойЧасти Из Объект.СоставПлана Цикл
		РассчитатьСуммуВсегоВстрокеТЧ(СтрокаТабличнойЧасти);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсегоВТЧСервер()
	Для Каждого СтрокаТабличнойЧасти Из Объект.СоставПлана Цикл
		СтрокаТабличнойЧасти.Всего = СтрокаТабличнойЧасти.Сумма + ?(Объект.СуммаВключаетНДС, 0, СтрокаТабличнойЧасти.СуммаНДС);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбновитьПараметрВыработкиВременныйСервер()
	Для Каждого ТекСтрокаТЧ Из Объект.СоставПлана Цикл
		ТекСтрокаТЧ.ПараметрВыработкиВременный = ТекСтрокаТЧ.ПараметрВыработки.Временный;
	КонецЦикла;
КонецПроцедуры

// Процедура заполняет Ставку НДС в табличной части по системе налогообложения.
// 
&НаСервере
Процедура ЗаполнитьСтавкуНДСПоНалогообложениеНДС()
	
	//СтавкаНДСПоУмолчанию = уатОбщегоНазначенияПовтИсп.ПолучитьСтавкуНДСНоль();
	СтавкаНДСПоУмолчанию = Перечисления.СтавкиНДС.ПустаяСсылка();
	Для каждого СтрокаТабличнойЧасти Из Объект.СоставПлана Цикл
		СтрокаТабличнойЧасти.СтавкаНДС = СтавкаНДСПоУмолчанию;
		СтрокаТабличнойЧасти.СуммаНДС = 0;
	КонецЦикла;
	
	Если Объект.УчитыватьНДС Тогда
		Элементы.СоставПланаСтавкаНДС.Видимость = Истина;
		Элементы.СоставПланаСуммаНДС.Видимость  = Истина;
		
		Для каждого СтрокаТабличнойЧасти Из Объект.СоставПлана Цикл
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС) Тогда
				СтрокаТабличнойЧасти.СтавкаНДС = СтрокаТабличнойЧасти.Номенклатура.СтавкаНДС;
			КонецЕсли;	
			
			СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
			СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
									  		СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
									  		СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
			
		КонецЦикла;
		
	Иначе
		Элементы.СоставПланаСтавкаНДС.Видимость = Ложь;
		Элементы.СоставПланаСуммаНДС.Видимость  = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьСтавкуНДСПоНалогообложениеНДС()

// Процедура рассчитывает сумму в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрокаТабличнойЧасти.ПараметрВыработкиВременный Тогда
		Колич = Цел(СтрокаТабличнойЧасти.Количество) + (СтрокаТабличнойЧасти.Количество - Цел(СтрокаТабличнойЧасти.Количество))/60*100;
	Иначе
		Колич = СтрокаТабличнойЧасти.Количество;
	КонецЕсли;
	СтрокаТабличнойЧасти.Сумма = Колич * СтрокаТабличнойЧасти.Цена;
	
	РассчитатьСуммуНДС(СтрокаТабличнойЧасти);
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

// Рассчитывается сумма НДС в строке табличной части.
//
&НаКлиенте
Процедура РассчитатьСуммуНДС(СтрокаТабличнойЧасти)
	
	СтавкаНДС = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеСтавкиНДС(СтрокаТабличнойЧасти.СтавкаНДС);
	
	СтрокаТабличнойЧасти.СуммаНДС = ?(Объект.СуммаВключаетНДС, 
	СтрокаТабличнойЧасти.Сумма - (СтрокаТабличнойЧасти.Сумма) / ((СтавкаНДС + 100) / 100),
	СтрокаТабличнойЧасти.Сумма * СтавкаНДС / 100);
	
КонецПроцедуры // РассчитатьСуммуНДС()

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	НДСВсего = Объект.СоставПлана.Итог("СуммаНДС");
	Объект.СуммаДокумента = Объект.СоставПлана.Итог("Сумма");
	Если Объект.УчитыватьНДС И НЕ Объект.СуммаВключаетНДС Тогда
		Объект.СуммаДокумента = Объект.СуммаДокумента + НДСВсего;
	КонецЕсли;
	ВывестиСуммовыеИтогиДокумента();
КонецПроцедуры

&НаСервере
Процедура ВывестиСуммовыеИтогиДокумента()
	
	Если Объект.УчитыватьНДС Тогда 
		Если Объект.СуммаВключаетНДС Тогда 
			НадписьВсегоНДС = НСтр("en='VAT amount';ru='НДС в сумме'") + ":";
		Иначе 
			НадписьВсегоНДС = НСтр("en='VAT from above';ru='НДС сверху'") + ":";
		КонецЕсли;
		НадписьВсего = НСтр("en='Total including VAT';ru='Всего с НДС'");
		Элементы.СтраницыИтогов.ТекущаяСтраница = Элементы.ИтогоУчетНДС;
	Иначе 
		НадписьВсего = НСтр("en='Total';ru='Всего'");
		Элементы.СтраницыИтогов.ТекущаяСтраница = Элементы.ИтогоБезНДС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВалютаДокумента) Или Объект.ВалютаДокумента = мВалютаРегламентированногоУчета Тогда 
		НадписьКурс = "(1.0000)";
		Элементы.НадписьКурс.Видимость = Ложь;
		Элементы.НадписьКурс2.Видимость = Ложь;
	Иначе 
		НадписьКурс = "(" + Формат(Объект.КурсДокумента, "ЧДЦ=4; ЧРД=.; ЧН=0.0000; ЧГ=0") + ")";
		Элементы.НадписьКурс.Видимость = Истина;
		Элементы.НадписьКурс2.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПравоРедактированиеДокумента()
	Рез = ПравоДоступа("Редактирование", Метаданные.Документы.уатПланированиеРаботыТС);
	Возврат Рез;
КонецФункции

&НаСервере
Процедура ПересчитатьСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(ИмяТЧ)
	уатОбщегоНазначенияСервер.ПересчитатьСуммуТабличнойЧастиПоФлагуСуммаВключаетНДС(Объект[ИмяТЧ], Объект.СуммаВключаетНДС);
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЦеныТабличнойЧастиПоВалюте(ВалютаРасчетовПередИзменением, ИмяТЧ)
	уатОбщегоНазначенияСервер.ПересчитатьЦеныТабличнойЧастиПоВалюте(Объект, ВалютаРасчетовПередИзменением, ИмяТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемВопрос(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.ОК Тогда
		флВопросЗакрытиеФормы = Ложь;
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КонтрольЗаполненияСтавкиНДС(Отказ, ВызовПередЗакрытиемФормы = Ложь)
	Если Объект.Сценарий.Раздел <> Перечисления.уатРазделыПланирования.ПредоставленныеУслуги Тогда
		Возврат;
	КонецЕсли;
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	уатОбщегоНазначения.КонтрольЗаполненияСтавкиНДС(ДокОбъект, Отказ, флВопросЗакрытиеФормы, ВызовПередЗакрытиемФормы);
КонецПроцедуры

#КонецОбласти
